Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/client/check_polling.po
Languages: uk_ua

source: Polling is a method of receiving updates by periodically sending requests. Once :attr:`check status <aiosend.types.Check.status>` is changed to :attr:`ACTIVATED <aiosend.enums.InvoiceStatus.ACTIVATED>`, :attr:`polling manager <aiosend.polling.PollingManager>` will call the :attr:`check_polling <aiosend.CryptoPay.check_polling>` handler. Check polling uses the :attr:`/getChecks <aiosend.CryptoPay.get_invoices>` method.
uk_ua: Полінг-це метод отримання повідомлень шляхом періодичної відправки запит. Після того, як :attr:`статус чека <aiosend.types.Check.status>` буде змінено на :attr:`ACTIVATED <aiosend.enums.InvoiceStatus.ACTIVATED>`, :attr:`поллінг менеджер <aiosend.polling.PollingManager>` викличе обробник :attr:`check_polling <aiosend.CryptoPay.check_polling>`. Полінг чеків використовує метод :attr:`/getChecks <aiosend.CryptoPay.get_invoices>`.

source: :attr:`Polling manager <aiosend.polling.PollingManager>` has :attr:`configuration <aiosend.polling.PollingConfig>` that defines the :attr:`delay <aiosend.polling.PollingConfig.delay>` (between requests) and :attr:`timeout <aiosend.polling.PollingConfig.timeout>` for each check in the awaiting queue. After the timeout polling manager will stop polling that check and call the :attr:`expired_check_polling <aiosend.CryptoPay.expired_check_polling>` handler if it is declared.
uk_ua: :attr:`поллінг менеджер <aiosend.polling.PollingManager>` має :attr:`конфігурацію <aiosend.polling.PollingConfig>`, в якій в якій задаються :attr:`затримка <aiosend.polling.PollingConfig.delay` між запитами та :attr:`таймаут <aiosend.polling.PollingConfig.timeout>` для кожного чека в черзі. Після закінчення таймауту менеджер припинить поллінг цього чека і викличе обробник :attr:`expired_check_polling <aiosend.CryptoPay.expired_check_polling>`, якщо той вказаний.

source: **Default is 2 seconds delay and 300 seconds (5 min) timeout**.
uk_ua: **За замовчуванням затримка між запитами - 2 секунди, а таймаут - 300 секунд (5 хвилин)**.

source: :ref:`You can change the polling configuration. <PollingConfigAnchor>`
uk_ua: :ref:`Ви можете змінити конфігурацію полінгу <PollingConfigAnchor>`

source: Register a handler for polling check updates.
uk_ua: Додавання обробника для повідомлень поллінга чеків.

source: Decorator for handler function.
uk_ua: Декоратор для функції-обробника.

source: Returns
uk_ua: Результат

source: handler function.
uk_ua: функція-обробник.

source: Register a handler for timed out checks.
uk_ua: Додавання обробника для минулих чеків.

source: Usage example
uk_ua: Приклад використання
