Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/client/invoice_polling.po
Languages: uk_ua

source: Invoice polling
uk_ua: Поллінг рахунків

source: Polling is a method of receiving updates by periodically sending requests. Once :attr:`invoice status <aiosend.types.Invoice.status>` is changed to :attr:`PAID <aiosend.enums.InvoiceStatus.PAID>`, :attr:`polling manager <aiosend.polling.PollingManager>` will call the :attr:`invoice_polling <aiosend.CryptoPay.invoice_polling>` handler. Invoice polling uses the :attr:`/getInvoices <aiosend.CryptoPay.get_invoices>` method.
uk_ua: Полінг-це метод отримання повідомлень шляхом періодичної відправки запит. Після того, як: attr:`статус рахунку <aiosend.types.Invoice.status>` буде змінено на: attr:' PAID <aiosend.enums.InvoiceStatus.PAID>`, : attr: 'поллінг-менеджер <auisend.polling.PollingManager> ' викличе обробник: attr:' invoice_polling <aiosend.CryptoPay.invoice_polling>`. Полінг рахунків використовує метод: attr:' /getInvoices <aiosend.CryptoPay.get_invoices>`.

source: :attr:`Polling manager <aiosend.polling.PollingManager>` has :attr:`configuration <aiosend.polling.PollingConfig>` that defines the :attr:`delay <aiosend.polling.PollingConfig.delay>` (between requests) and :attr:`timeout <aiosend.polling.PollingConfig.timeout>` for each invoice in the awaiting queue. After the timeout polling manager will stop polling that invoice and call the :attr:`expired_invoice_polling <aiosend.CryptoPay.expired_invoice_polling>` handler if it is declared.
uk_ua: Менеджер опитування (: attr:' Polling manager <aiosend.polling.PollingManager>') має налаштування (:attr:`configuration <aiosend.polling.PollingConfig>`), в яких задаються :attr:' затримка <aiosend.polling.PollingConfig.delay> ' між запитами і: attr:`таймаут <aiosend.polling.PollingConfig.timeout> ' для кожного рахунку в черзі. Після закінчення таймауту менеджер припиняє опитування даного рахунку і, якщо вказано, викликає обробник :attr:`expired_invoice_polling <aiosend.CryptoPay.expired_invoice_polling>`.

source: **Default is 2 seconds delay and 300 seconds (5 min) timeout**.
uk_ua: ** За замовчуванням затримка між запитами — 2 секунди, а таймаут — 300 секунд (5 хвилин)**.

source: :ref:`You can change the polling configuration. <PollingConfigAnchor>`
uk_ua: : ref: `ви можете змінити налаштування опитування. <PollingConfigAnchor>`

source: Register a handler for polling invoice updates.
uk_ua: Призначте функцію-обробник для оновлень рахунків при опитуванні.

source: Decorator for handler function.
uk_ua: Декоратор для функції-обробника.

source: Return type
uk_ua: Тип результату

source: Returns
uk_ua: Результат

source: handler function.
uk_ua: функція-обробник.

source: Register a handler for timed out invoices.
uk_ua: Призначте функцію-обробник для рахунків з вичерпаним часом очікування.

source: Usage example
uk_ua: Приклад використання
