Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/client/shortcuts.po
Languages: ru, uk_ua

source: Shortcut methods
ru: Сокращённые методы
uk_ua: Скорочені методи

source: These methods simplify the use of standard :ref:`Crypto Pay API methods <MethodsAnchor>` and also provide additional functionality to the objects.
ru: Эти методы упрощают использование стандартных :ref:`методов Crypto Pay API <MethodsAnchor>`, а также предоставляют дополнительный функционал для объектов.
uk_ua: Ці методи спрощують використання стандартних :ref:`методів Crypto PayAPI <MethodsAnchor>`, а також надають додатковий функціонал для об'єктів.

source: Updating objects
ru: Обновление объектов
uk_ua: Оновлення об'єктів

source: Shortcut for method :meth:`aiosend.CryptoPay.get_balance`.
ru: Сокращение для метода :meth:`aiosend.CryptoPay.get_balance`.
uk_ua: Скорочення методу :meth:`aiosend.CryptoPay.get_balance`.

source: Use this method to update balance object.
ru: Используйте этот метод для обновления объекта баланса.
uk_ua: Використовуйте цей метод для оновлення об'єкта балансу.

source: Source: https://help.crypt.bot/crypto-pay-api#getBalance
ru: Источник: https://help.crypt.bot/crypto-pay-api#getBalance
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getBalance

source: Shortcut for method :meth:`aiosend.CryptoPay.get_checks`.
ru: Сокращение для метода :meth:`aiosend.CryptoPay.get_checks`.
uk_ua: Скорочення методу :meth:`aiosend.CryptoPay.get_checks`.

source: Use this method to update check object.
ru: Используйте этот метод для обновления объекта чека.
uk_ua: Використовуйте цей метод для оновлення об'єкта чека.

source: Source: https://help.crypt.bot/crypto-pay-api#getChecks
ru: Источник: https://help.crypt.bot/crypto-pay-api#getChecks
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getChecks

source: Shortcut for method :meth:`aiosend.CryptoPay.get_exchange_rates`.
ru: Сокращение для метода :meth:`aiosend.CryptoPay.get_exchange_rates`.
uk_ua: Скорочення методу :meth:`aiosend.CryptoPay.getExchangeRates`.

source: Use this method to update ExchangeRate object.
ru: Используйте этот метод для обновления объекта ExchangeRate
uk_ua: Використовуйте цей метод для оновлення об'єкта ExchangeRate

source: Source: https://help.crypt.bot/crypto-pay-api#getExchangeRates
ru: Источник: https://help.crypt.bot/crypto-pay-api#getExchangeRates
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getExchangeRates

source: Shortcut for method :meth:`aiosend.CryptoPay.get_invoices`.
ru: Сокращение для метода :meth:`aiosend.CryptoPay.get_invoices`.
uk_ua: Скорочення методу :meth:`aiosend.CryptoPay.get_invoices`.

source: Use this method to update invoice object.
ru: Используйте этот метод для обновления объекта счёта.
uk_ua: Використовуйте цей метод для оновлення об'єкта рахунку.

source: Source: https://help.crypt.bot/crypto-pay-api#getInvoices
ru: Источник: https://help.crypt.bot/crypto-pay-api#getInvoices
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getInvoices

source: Deleting objects
ru: Удаление объектов
uk_ua: Видалення об'єктів

source: Shortcut for method :meth:`aiosend.CryptoPay.delete_check`.
ru: Сокращение для метода :meth:`aiosend.CryptoPay.delete_check`.
uk_ua: Скорочення методу :meth:`aiosend.CryptoPay.delete_check`.

source: Use this method to delete check created by your app. Returns :code:`True` on success.
ru: Используйте этот метод для удаления чека, созданного вашим приложением. Возвращает :code:`True` в случае успеха.
uk_ua: Використовуйте цей метод для видалення чека, створеного вашою програмою.Повертає :code:`True` у разі успіху.

source: Source: https://help.crypt.bot/crypto-pay-api#deleteCheck
ru: Источник: https://help.crypt.bot/crypto-pay-api#deleteCheck
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#deleteCheck

source: :code:`True` on success.
ru: :code:`True` в случае успеха.
uk_ua: :code:`True` у разі успіху

source: Shortcut for method :meth:`aiosend.CryptoPay.delete_invoice`.
ru: Сокращение для метода :meth:`aiosend.CryptoPay.delete_invoice`.
uk_ua: Скорочення методу :meth:`aiosend.CryptoPay.delete_invoice`.

source: Use this method to delete invoice created by your app. Returns :code:`True` on success.
ru: Используйте этот метод, чтобы удалить счёт, созданный вашим приложением. Возвращает :code:`True` в случае успеха.
uk_ua: Використовуйте цей метод, щоб видалити рахунок, створений вашою програмою.Повертає :code:`True` у разі успіху.

source: Source: https://help.crypt.bot/crypto-pay-api#hwjK
ru: Источник: https://help.crypt.bot/crypto-pay-api#hwjK
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#hwjK

source: QR code of object
ru: QR код объекта
uk_ua: QR код об'єкта

source: Get check qr code.
ru: Получить qr код чека.
uk_ua: Отримати QR код чека.

source: check qr code url.
ru: URL qr кода чека.
uk_ua: URL qr коду чека.

source: Get invoice qr code.
ru: Получить qr код счёта.
uk_ua: Отримати код qr рахунку.

source: invoice qr code url.
ru: URL qr кода счёта.
uk_ua: URL qr коду рахунку.

source: Check image
ru: URL изображения чека.
uk_ua: URL зображення чека.

source: Get check preview image.
ru: Получить изображение предпросмотра чека.
uk_ua: Отримати зображення предперегляду чека.

source: check image url.
ru: URL изображения чека.
uk_ua: URL зображення чека.

source: Poll objects
ru: Опрашивание объектов
uk_ua: Опитування об'єктів

source: Send the check to the polling manager.
ru: Отправить чек в менеджер поллинга.
uk_ua: Надіслати чек у менеджер поллінга.

source: Use this method to check the status of the check until the timeout expires.
ru: Используйте этот метод для проверки статуса чека до тех пор, пока не истечёт тайм-аут.
uk_ua: Використовуйте цей метод для перевірки статусу чека до тих пір, поки не Закінчиться тайм-аут.

source: additional payload for the handler.
ru: Дополнительная полезная нагрузка для функции-обработчика
uk_ua: Додаткове корисне навантаження для функції-обробника

source: Send the invoice to the polling manager.
ru: Отправить счёт в менеджер поллинга.
uk_ua: Надіслати рахунок в менеджер поллінга.

source: Use this method to check the status of the invoice until the timeout expires.
ru: Используйте этот метод для проверки статуса счёта до тех пор, пока не истечёт тайм-аут.
uk_ua: Використовуйте цей метод для перевірки статусу рахунку, поки не Закінчиться тайм-аут.

source: Usage examples
ru: Пример использования
uk_ua: Приклад використання
