Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/client/tools.po
Languages: ru, uk_ua

source: Tools
ru: Инструменты
uk_ua: Інструменти

source: Additional functionality.
ru: Дополнительные функции
uk_ua: Додаткові функції

source: Exchange currency.
ru: Обменный курс валюты
uk_ua: Обмінний курс валюти

source: Wrapper for :meth:`aiosend.CryptoPay.get_exchange_rates`.
ru: Обёртка для :meth:`aiosend.CryptoPay.get_exchange_rates`.
uk_ua: Обгортка для :meth:`aiosend.CryptoPay.get_exchange_rates`.

source: Use this method to get the equivalent amount in the target currency for the source currency.
ru: Используйте этот метод для получения эквивалентной суммы целевой валюты для исходной
uk_ua: Використовуйте цей метод для отримання еквівалентної суми цільової валюти для вихідної

source: Return type
ru: Тип результата

source: :class:`float` on success.
ru: :class:`float` в случае успеха.
uk_ua: :class:`float` у разі успіху

source: :class:`aiosend.exceptions.CryptoPayError` if there is no such exchange rate.
ru: :class:`aiosend.exceptions.CryptoPayError` если нет такого обменного курса.
uk_ua: :class:`aiosend.exceptions.CryptoPayError` якщо такого обмінного курсу немає.

source: Usage example
ru: Пример использования
uk_ua: Приклад використання

source: Get the balance of a specific asset.
ru: Получение баланса указанного актива.
uk_ua: Отримання балансу зазначеного активу.

source: Wrapper for :meth:`aiosend.CryptoPay.get_balance`.
ru: Обёртка для :meth:`aiosend.CryptoPay.get_balance`.
uk_ua: Обгортка для :meth:`aiosend.CryptoPay.get_balance`.

source: Use this method to get the balance of a specific asset.
ru: Используйте этот метод для получения баланса указанного актива.
uk_ua: Використовуйте цей метод для отримання балансу зазначеного активу.

source: :class:`aiosend.types.Balance` on success.
ru: :class:`aiosend.types.Balance` в случае успеха.
uk_ua: :class:`aiosend.types.Balance` у разі успіху.

source: :class:`aiosend.exceptions.CryptoPayError` if there is no such asset.
ru: :class:`aiosend.exceptions.CryptoPayError` если нет такого актива.
uk_ua: :class:`aiosend.exceptions.CryptoPayError` якщо немає такого активу.

source: Get exactly one invoice or none.
ru: Получение ровно одного счёта, или ничего.
uk_ua: Отримайте рівно один рахунок або жодного.

source: Wrapper for :meth:`aiosend.CryptoPay.get_invoices`
ru: Обёртка для :meth:`aiosend.CryptoPay.get_invoices`
uk_ua: Обгортка для :meth:`aiosend.CryptoPay.get_invoices`

source: Use this method to update status of an existing invoice object or to get this object by passing the invoice id.
ru: Используйте этот метод для обновления статуса существующего объекта счёта или получения этого объекта, передавая id счёта.
uk_ua: Використовуйте цей метод для оновлення статусу наявного об'єкта рахунку або отримання цього об'єкта, передаючи id рахунку.

source: :class:`aiosend.types.Invoice` object.
ru: Объект :class:`aiosend.types.Invoice`.
uk_ua: Об'єкт :class:`aiosend.types.Invoice`.

source: Get exactly one check or none.
ru: Получение ровно одного чека, или ничего.
uk_ua: Отримання рівно одного чека, або нічого.

source: Wrapper for :meth:`aiosend.CryptoPay.get_checks`
ru: Обёртка для :meth:`aiosend.CryptoPay.get_checks`
uk_ua: Обгортка для :meth:`aiosend.CryptoPay.get_checks`

source: Use this method to update status of an existing check object or to get this object by passing the check id.
ru: Используйте этот метод для обновления статуса существующего объекта чека или получения этого объекта, передавая id чека.
uk_ua: Використовуйте цей метод для оновлення статусу існуючого об'єкта чека або отримання цього об'єкта, передаючи id чека."

source: :meth:`aiosend.types.Check` object.
ru: Объект :meth:`aiosend.types.Check`.
uk_ua: Об'єкт: meth:`aiosend.types.Check`.

source: Delete all checks.
ru: Удаление всех чеков.
uk_ua: Видалення всіх чеків.

source: Wrapper for :meth:`aiosend.CryptoPay.get_checks` and :meth:`aiosend.CryptoPay.delete_check`
ru: Обёртка для :meth:`aiosend.CryptoPay.get_checks` и :meth:`aiosend.CryptoPay.delete_check`
uk_ua: Обгортка для :meth:`aiosend.CryptoPay.get_checks` І :meth:`aiosend.CryptoPay.delete_check`

source: Use this method to delete all existing checks created by your app.
ru: Используйте этот метод для удаления всех существующих чеков, созданных вашим приложением.
uk_ua: Використовуйте цей метод для видалення всіх існуючих чеків, створених вашим додатком.

source: Delete all invoices.
ru: Удаление всех счетов.
uk_ua: Видалення всіх рахунків.

source: Wrapper for :meth:`aiosend.CryptoPay.get_invoices` and :meth:`aiosend.CryptoPay.delete_invoice`
ru: Обёртка ждя :meth:`aiosend.CryptoPay.get_invoices` и :meth:`aiosend.CryptoPay.delete_invoice`
uk_ua: Обгортка для :meth:`aiosend.CryptoPay.get_invoices` та :meth:`aiosend.CryptoPay.delete_invoice`

source: Use this method to delete all existing invoices created by your app.
ru: Используйте этот метод дял удаления всех существующих счетов, созданных вашим приложением
uk_ua: Використовуйте цей метод для видалення всіх існуючих рахунків, створених вашим додатком

source: Get rates image.
ru: Получение изображения курса.
uk_ua: Отримання зображення курсу.

source: Use this method to get exchange rates image.
ru: Используйте этот метод для получения картинки обменного курса.
uk_ua: Використовуйте цей метод для отримання зображення обмінного курсу.

source: rates image url.
ru: Ссылка на изображение курса.
uk_ua: Посилання на зображення курсу.
