Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: ru, uk_ua

source: Installation
ru: Установка
uk_ua: Установка

source: via `pip <https://pip.pypa.io/>`_
ru: С помощью `pip <https://pip.pypa.io/en/stable/>`_
uk_ua: за допомогою `pip <https://pip.pypa.io/>`_

source: from `PyPI <https://pypi.org/p/aiosend/>`_
ru: из `PyPI <https://pypi.org/p/aiosend/>`_
uk_ua: з `PyPI <https://pypi.org/p/aiosend/>`_

source: from `GitHub <https://github.com/vovchic17/aiosend>`_
ru: из `GitHub <https://github.com/vovchic17/aiosend>`_
uk_ua: з `GitHub <https://github.com/vovchic17/aiosend>`_

source: via `uv <https://docs.astral.sh/uv/>`_
ru: С помощью `uv <https://docs.astral.sh/uv/>`_
uk_ua: за допомогою `uv <https://docs.astral.sh/uv/>`_

source: via `Poetry <https://python-poetry.org/>`_
ru: С помощью `Poetry <https://python-poetry.org/>`_
uk_ua: за допомогою `Poetry <https://python-poetry.org/>`_

source: via `PDM <https://pdm-project.org/>`_
ru: С помощью `PDM <https://pdm-project.org/>`_
uk_ua: за допомогою `PDM <https://pdm-project.org/>`_

source: via `pipx <https://pipx.pypa.io/>`_
ru: С помощью `pipx <https://pipx.pypa.io/>`_
uk_ua: за допомогою `pipx <https://pipx.pypa.io/>`_

source: via `Rye <https://rye.astral.sh/>`_
ru: С помощью `Rye <https://rye.astral.sh/>`_
uk_ua: за допомогою `Rye <https://rye.astral.sh/>`_

source: via `Conda <https://docs.conda.io/>`_
ru: С помощью `Conda <https://docs.conda.io/>`_
uk_ua: за допомогою `Conda <https://docs.conda.io/>`_

source: via `Pipenv <https://pipenv.pypa.io/>`_
ru: С помощью `Pipenv <https://pipenv.pypa.io/>`_
uk_ua: за допомогою `Pipenv <https://pipenv.pypa.io/>`_
