Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/types.po
Languages: uk_ua

source: Types
uk_ua: Типи

source: `Crypto Pay API <https://help.crypt.bot/crypto-pay-api>`_ types implementation.
uk_ua: Реалізація типів `Crypto pay API <https://help.crypt.bot/crypto-pay-api>`_

source: App object.
uk_ua: Об'єкт App.

source: This object represents the `Crypto Pay` app.
uk_ua: Цей об'єкт представляє додаток 'Crypto Pay'.

source: Crypto Pay app id.
uk_ua: id додатки Crypto Pay

source: Crypto Pay app name.
uk_ua: Назва програми Crypto Pay.

source: Telegram username of the payment processing bot.
uk_ua: Ім'я користувача telegram бота для обробки платежів.

source: AppStats object.
uk_ua: Об'єкт AppStats.

source: Source: http://help.crypt.bot/crypto-pay-api#wnPA
uk_ua: Джерело: http://help.crypt.bot/crypto-pay-api#wnPA

source: Conversion of all created invoices.
uk_ua: Конверсія всіх створених рахунків.

source: Total created invoice count.
uk_ua: Загальна кількість створених рахунків.

source: The date on which the statistics calculation was ended in ISO 8601 format.
uk_ua: Дата, на яку було завершено розрахунок статистики у форматі ISO 8601.

source: Total paid invoice count.
uk_ua: Загальна кількість оплачених рахунків.

source: The date on which the statistics calculation was started in ISO 8601 format.
uk_ua: Дата, з якої було розпочато розрахунок статистики у форматі ISO 8601.

source: The unique number of users who have paid the invoice.
uk_ua: Унікальна кількість користувачів, які сплатили рахунок.

source: Total volume of paid invoices in USD.
uk_ua: Загальний обсяг оплачених рахунків в USD.

source: Balance object.
uk_ua: Об'єкт Balance.

source: Source: https://help.crypt.bot/crypto-pay-api#Balance
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#Balance

source: Total available amount in float.
uk_ua: Загальна доступна сума у вигляді дійсного числа.

source: Cryptocurrency alphabetic code. Currently, can be “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet).
uk_ua: Алфавітний код криптовалюти. В даний час це можуть бути "USDT","TON", "BTC", "ETH", "LTC", "BNB", "TRX" і "USDC" (і " JET " для тестової мережі).

source: Unavailable amount currently is on hold in float.
uk_ua: Недоступна сума, що знаходиться на утриманні, у вигляді дійсного числа.

source: Shortcut for method :class:`aiosend.CryptoPay.get_balance`.
uk_ua: Альтернатива методу :class:`aiosend.CryptoPay.get_balance`.

source: Use this method to update balance object.
uk_ua: Використовуйте цей метод для оновлення об'єкта балансу.

source: Source: https://help.crypt.bot/crypto-pay-api#getBalance
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getBalance

source: Return type
uk_ua: Тип результату

source: Returns
uk_ua: Результат

source: Check object.
uk_ua: Об'єкт Check.

source: Source: https://help.crypt.bot/crypto-pay-api#Check
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#Check

source: Date the check was activated in ISO 8601 format.
uk_ua: Дата активації чека в форматі ISO 8601.

source: Amount of the check in float.
uk_ua: Сума чека у вигляді дійсного числа.

source: URL should be provided to the user to activate the check.
uk_ua: URL, який повинен бути представлений користувачеві для активації чека.

source: Unique ID for this check.
uk_ua: Унікальний ID чека.

source: Date the check was created in ISO 8601 format.
uk_ua: Дата створення чека в форматі ISO 8601.

source: Shortcut for method :class:`aiosend.CryptoPay.delete_check`.
uk_ua: Альтернатива методу :class:`aiosend.CryptoPay.delete_check`.

source: Use this method to delete check created by your app. Returns :code:`True` on success.
uk_ua: Використовуйте цей метод для видалення чека, створеного вашим додатком. Повертає :code:`True` у разі успіху.

source: Source: https://help.crypt.bot/crypto-pay-api#deleteCheck
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#deleteCheck

source: :code:`True` on success.
uk_ua: :code:`True` у разі успіху.

source: Get check preview image.
uk_ua: Отримати зображення попереднього перегляду чека.

source: check image url.
uk_ua: url зображення чека.

source: Hash of the check.
uk_ua: Хеш чека.

source: Send the check to the polling manager.
uk_ua: Отправить чек в поллинг-менеджер.

source: Use this method to check the status of the check until the timeout expires.
uk_ua: Використовуйте цей метод для перевірки статусу чека до тих пір,поки не закінчиться тайм-аут.

source: Parameters
uk_ua: Параметри

source: additional payload for the handler.
uk_ua: додаткове корисне навантаження для функції-обробника.

source: Get check qr code.
uk_ua: Отримати qr код чека.

source: check qr code url.
uk_ua: Отримати qr код чека.

source: Status of the check, can be “active” or “activated”.
uk_ua: Статус чека, може бути "active"або " activated".

source: Base object class for types.
uk_ua: Базовий клас об'єкта типу.

source: Currency object.
uk_ua: Об'єкт Currency.

source: This object represents an `Crypto Pay` currency.
uk_ua: Цей об'єкт представляє об'єкт валюти 'Crypto Pay'.

source: Currency code.
uk_ua: Код валюти.

source: Currency decimals.
uk_ua: Десяткові дроби валюти.

source: True, if the currency is blockchain currency.
uk_ua: True, якщо валюта є блокчейн-валютою.

source: True, if the currency is fiat.
uk_ua: True, якщо валюта є фіатной.

source: True, if the currency is stablecoin.
uk_ua: True, якщо валюта є стабільною монетою.

source: Currency name.
uk_ua: Назва валюти.

source: Currency url.
uk_ua: url валюти.

source: API error model.
uk_ua: Модель помилки API.

source: ExchangeRate object.
uk_ua: Об'єкт ExchangeRate.

source: Source: https://help.crypt.bot/crypto-pay-api#ExchangeRate
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#ExchangeRate

source: True, if the source is the cryptocurrency.
uk_ua: True, якщо вихідна валюта є криптовалютою.

source: True, if the source is the fiat currency.
uk_ua: True, якщо початкова валюта є фіатною валютою.

source: True, if the received rate is up-to-date.
uk_ua: True, якщо отриманий курс актуальний.

source: The current rate of the source asset valued in the target currency.
uk_ua: Поточний курс початкової валюти, оцінений у цільовій валюті.

source: Shortcut for method :class:`aiosend.CryptoPay.getExchangeRates`.
uk_ua: Альтернатива методу :class:`aiosend.CryptoPay.getExchangeRates`.

source: Use this method to update ExchangeRate object.
uk_ua: Використовуйте цей метод для оновлення Об'єкта ExchangeRate.

source: Source: https://help.crypt.bot/crypto-pay-api#getExchangeRates
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getExchangeRates

source: Invoice object.
uk_ua: Об'єкт Invoice.

source: Source: https://help.crypt.bot/crypto-pay-api#Invoice
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#Invoice

source: True, if the user can pay the invoice anonymously.
uk_ua: True, якщо користувач може оплатити рахунок анонімно.

source: True, if the user can add comment to the payment.
uk_ua: True, якщо користувач може залишити коментар до платежу.

source: Amount of the invoice for which the invoice was created.
uk_ua: Сума створеного рахунку.

source: *Optional*. Cryptocurrency code. Available only if the value of the field currency_type is “crypto”. Currently, can be “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet).
uk_ua: *Опціонально*. Код криптовалюти. Доступний тільки якщо значення поля currency_type є ”crypto”. На даний момент може бути ”USDT”, ”TON”,”BTC”, ”ETH”, ”LTC”, ”BNB”, ”TRX” і ”USDC” (і ”JET” для testnet).

source: URL should be provided to the user to pay the invoice.
uk_ua: URL, який повинен бути предствлен користувачеві для оплати рахунку.

source: *Optional*. Comment to the payment from the user.
uk_ua: * Опціонально*. Коментар користувача до платежу.

source: Date the invoice was created in ISO 8601 format.
uk_ua: Дата створення рахунку в форматі ISO 8601.

source: Type of the price, can be “crypto” or “fiat”.
uk_ua: Тип ціни, може бути ”crypto” або ”fiat”.

source: Shortcut for method :class:`aiosend.CryptoPay.delete_invoice`.
uk_ua: Альтернатива методу :class:`aiosend.CryptoPay.delete_invoice`.

source: Use this method to delete invoice created by your app. Returns :code:`True` on success.
uk_ua: Використовуйте цей метод для видалення рахунку, створеного вашим додатком. Повертає :code:`True` у разі успіху.

source: Source: https://help.crypt.bot/crypto-pay-api#hwjK
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#hwjK

source: *Optional*. Description for this invoice.
uk_ua: * Опціонально*. Опис даного рахунку.

source: *Optional*. Date the invoice expires in ISO 8601 format.
uk_ua: * Опціонально*. Дата закінчення терміну дії рахунку в форматі ISO 8601.

source: *Optional*. Amount of charged service fees. Available only in the payload of the webhook update (described here for reference).
uk_ua: * Опціонально*. Сума плати за обслуговування. Доступно тільки в корисному навантаженні webhook оновлення (описано тут для довідки).

source: *Optional*. Asset of service fees charged when the invoice was paid. Available only if status is “paid”.
uk_ua: *Опціонально*. Валюта плати за обслуговування, що стягується при оплаті рахунку. Доступна тільки при наявності статусу “оплачено”.

source: *Optional*. Fiat currency code. Available only if the value of the field currency_type is “fiat”. Currently one of “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS".
uk_ua: *Опціонально*. Код фіатної валюти. Доступний тільки якщо значення поля currency_type є “fiat”. На даний момент може бути “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS".

source: Hash of the invoice.
uk_ua: Хеш рахунку

source: *Optional*. Text of the hidden message for this invoice.
uk_ua: * Опціонально*. Текст прихованого повідомлення рахунку.

source: Unique ID for this invoice.
uk_ua: Унікальний ID даного рахунку.

source: Use this URL to pay an invoice to the Telegram Mini App version.
uk_ua: Використовуйте цей URL щоб оплатити рахунок в Telegram Mini App версії.

source: *Optional*. Amount of the invoice for which the invoice was paid. Available only if currency_type is “fiat” and status is “paid”.
uk_ua: *Опціонально*. Сума оплаченого рахунку. Доступно тільки якщо currency_type є “fiat” і статус є “paid”.

source: True, if the invoice was paid anonymously.
uk_ua: True, якщо рахунок був оплачений анонімно.

source: *Optional*. Cryptocurrency alphabetic code for which the invoice was paid. Available only if currency_type is “fiat” and status is “paid”.
uk_ua: *Опціонально*. Алфавітний код криптовалюти оплаченого рахунку. Доступний тільки якщо currency_type є “fiat” і статус є “paid”.

source: *Optional*. Date the invoice was paid in ISO 8601 format.
uk_ua: * Опціонально*. Дата оплати рахунку в форматі ISO 8601.

source: *Optional*. Label of the button, can be “viewItem”, “openChannel”, “openBot” or “callback”.
uk_ua: “openBot” або “callback”.

source: *Optional*. URL opened using the button.
uk_ua: * Опціонально*. URL, який відкривається при натисканні на кнопку.

source: *Optional*. The rate of the paid_asset valued in the fiat currency. Available only if the value of the field currency_type is “fiat” and the value of the field status is “paid”.
uk_ua: *Опціонально*. Курс оплаченої валюти, виражений у фіатній валюті. Доступний тільки якщо значення поля currency_type є “fiat” ізначення поля status є “paid”.

source: *Optional*. Price of the asset in USD. Available only if status is “paid”.
uk_ua: * Опціонально*. Ціна валюти в USD. Доступна тільки якщо статус є “paid”.

source: *Deprecated*. URL should be provided to the user to pay the invoice (described here for reference).
uk_ua: *Постарілий*. URL, який повинен бути предствлен користувачеві для оплати рахунку. (описано тут для довідки).

source: *Optional*. Previously provided data for this invoice.
uk_ua: * Опціонально*. Раніше надана корисне навантаження рахунку.

source: Send the invoice to the polling manager.
uk_ua: Надіслати рахунок в поллінг-менеджер.

source: Use this method to check the status of the invoice until the timeout expires.
uk_ua: "Використовуйте цей метод для перевірки статусу рахунку до тих пір,пока не истечет тайм-аут.

source: Get invoice qr code.
uk_ua: Отримати qr код рахунку.

source: invoice qr code.
uk_ua: qr код рахунку

source: Status of the transfer, can be “active”, “paid” or “expired”.
uk_ua: Статус перекладу, може бути “active”, “paid” або “expired”.

source: Shortcut for method :class:`aiosend.CryptoPay.get_invoices`.
uk_ua: Альтернатива методу :class:`aiosend.CryptoPay.get_invoices`.

source: Use this method to update invoice object.
uk_ua: Використовуйте цей метод для оновлення об'єкта рахунку.

source: Source: https://help.crypt.bot/crypto-pay-api#getInvoices
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getInvoices

source: *Optional*. Price of the asset in USD. Available only in the Webhook update payload.
uk_ua: *Опціонально*. Ціна валюти в USD. Доступна тільки в корисному навантаженні webhook оновлення

source: Use this URL to pay an invoice to the Web version of Crypto Bot.
uk_ua: Використовуйте цей URД для оплати рахунку в Веб версії Crypto bot.

source: Items list.
uk_ua: Список елементів.

source: This model is used to convert a dictionary with the `items` key to a list.
uk_ua: Ця модель використовується для конвертації словника з ключем `items` в список.

source: API response model.
uk_ua: Модель відповіді API.

source: Transfer object.
uk_ua: Об'єкт Transfer.

source: Source: https://help.crypt.bot/crypto-pay-api#Transfer
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#Transfer

source: Amount of the transfer in float.
uk_ua: Сума переказу у вигляді речового числа.

source: *Optional*. Comment for this transfer.
uk_ua: * Опціонально*. Коментар до перекладу.

source: Date the transfer was completed in ISO 8601 format.
uk_ua: Дата виконання перекладу в форматі ISO 8601.

source: Unique UTF-8 string.
uk_ua: Унікальна UTF - 8 рядок.

source: Status of the transfer, can only be “completed”.
uk_ua: Статус перекладу, може бути тільки “completed”.

source: Unique ID for this transfer.
uk_ua: Уникальный ID для данного перевода.

source: Telegram user ID the transfer was sent to.
uk_ua: Telegram ID пользователя, которому был отправлен перевод.

source: Update object.
uk_ua: Об'єкт Update.

source: Source: https://help.crypt.bot/crypto-pay-api#webhook-updates
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#webhook-updates

source: Payload contains the class Invoice.
uk_ua: Корисне навантаження, яке містить клас Invoice.

source: Date the request was sent in ISO 8601 format.
uk_ua: Дата надсилання запиту у форматі ISO 8601.

source: Non-unique update ID.
uk_ua: Неунікальний ID оновлення.

source: `invoice_paid` - the update sent when the invoice is paid.
uk_ua: `invoice_paid` - оновлення було відправлено коли рахунок був оплачений.

source: type
uk_ua: тип

source: Webhook update type. Supported update types
uk_ua: Тип webhook оновлення. Підтримувані типи оновлень
