Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/api/methods.po
Languages: ru, uk_ua

source: Use this method to get balances of your app. Requires no parameters. Returns array of :class:`aiosend.types.Balance`.
ru: Используйте этот метод для получения балансов вашего приложения. Не требует параметров. Возвращает массив объектов :class:`aiosend.types.Balance`.
uk_ua: Використовуйте цей метод для отримання балансів вашої програми. Не вимагає параметрів. Повертає масив об'єктів :class:`aiosend.types.Balance`.

source: Source: https://help.crypt.bot/crypto-pay-api#getBalance
ru: Источник: https://help.crypt.bot/crypto-pay-api#getBalance
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getBalance

source: List of :class:`aiosend.types.Balance` objects.
ru: Список объектов :class:`aiosend.types.Balance`.
uk_ua: Список об'єктів: class: `aiosend.types.Balance`.

source: getExchangeRates method.
ru: Метод getExchangeRates.
uk_ua: Метод getExchangeRates.

source: Use this method to get exchange rates of supported currencies. Requires no parameters. Returns array of :class:`aiosend.types.ExchangeRate`.
ru: Используйте этот метод для получения обменных курсов поддерживаемых валют. Не требует параметров. Возвращает массив объектов :class:`aiosend.types.ExchangeRate`.
uk_ua: Використовуйте цей метод для отримання обмінних курсів підтримуваних валют. Не потребує параметрів. Повертає масив об'єктів :class:`aiosend.types.ExchangeRate`.

source: Source: https://help.crypt.bot/crypto-pay-api#getExchangeRates
ru: Источник: https://help.crypt.bot/crypto-pay-api#getExchangeRates
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getExchangeRates

source: List of :class:`aiosend.types.ExchangeRate` objects.
ru: Список объектов :class:`aiosend.types.ExchangeRate`.
uk_ua: Список об'єктів :class:`aiosend.types.ExchangeRate`.

source: getCurrencies method.
ru: Метод getCurrencies.
uk_ua: Метод getCurrencies.

source: Use this method to get a list of supported currencies. Requires no parameters. Returns a list of fiat and cryptocurrency alphabetic codes.
ru: Используйте этот метод для получения списка поддерживаемых валют. Не требует параметров. Возвращает список алфавитных кодов фиатной валюты и криптовалюты.
uk_ua: Використовуйте цей метод для отримання списку підтримуваних валют. Не вимагає параметрів. Повертає список алфавітних кодів фіатної валюти та криптовалюти.

source: Source: https://help.crypt.bot/crypto-pay-api#getCurrencies
ru: Источник: https://help.crypt.bot/crypto-pay-api#getCurrencies
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getCurrencies

source: List of :class:`aiosend.types.Currency` objects.
ru: Список объектов :class:`aiosend.types.Currency`.
uk_ua: Список об'єктів :class:`aiosend.types.Currency`.

source: getStats method.
ru: Метод getStats.
uk_ua: Метод getStats.

source: Use this method to get app statistics. On success, returns :class:`aiosend.types.AppStats`.
ru: Используйте этот метод для получения статистики приложения. В случае успеха возвращает объект :class:`aiosend.types.AppStats`.
uk_ua: Використовуйте цей метод для отримання статистики програми. У разі успіху повертає об'єкт :class:`aiosend.types.AppStats`.

source: Source: https://help.crypt.bot/crypto-pay-api#jvP3
ru: Источник: https://help.crypt.bot/crypto-pay-api#jvP3
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#jvP3

source: *Optional*. Date from which start calculating statistics. Default is current date minus 24 hours.
ru: *Опционально*. Дата от которой начинается подсчёт статистики. По умолчанию это текущая дата минус 24 часа.
uk_ua: *Опціонально*. Дата від якої починається підрахунок статистики. За замовчуванням це поточна дата мінус 24 години.

source: *Optional*. The date on which to finish calculating statistics. Default is current date.
ru: *Опционально*. Дата на которой заканчивается подсчёт статистики. По умолчанию текущая дата.
uk_ua: *Опціонально*. Дата на якій закінчується підрахунок статистики.За замовчуванням поточна дата.

source: :class:`aiosend.types.AppStats` object.
ru: Объект :class:`aiosend.types.AppStats`
uk_ua: Об'єкт :class:`aiosend.types.AppStats`
