Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/api/methods.po
Languages: ru, uk_ua

source: Methods
ru: Методы
uk_ua: Методи

source: `Crypto Pay API <https://help.crypt.bot/crypto-pay-api>`_ methods implementation.
ru: Реализации методов `Crypto Pay API <https://help.crypt.bot/crypto-pay-api>`_
uk_ua: Реалізація методів `Crypto Pay API <https://help.crypt.bot/crypto-pay-api>`_

source: getMe method.
ru: Метод getMe.
uk_ua: Метод getMe.

source: Use this method to test your app's authentication token. Requires no parameters. On success, returns basic information about an app.
ru: Используйте этот метод для проверки токена аутентификации вашего приложения. Не требует параметров. В случае успеха возвращает базовую информацию о вашем приложении.
uk_ua: Використовуйте цей метод для перевірки токена аутентифікації вашого додатки. Не вимагає параметрів. У разі успіху повертає базову інформацію про ваш додаток.

source: Source: https://help.crypt.bot/crypto-pay-api#getMe
ru: Источник: https://help.crypt.bot/crypto-pay-api#getMe
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getMe

source: :class:`aiosend.types.App` object.
ru: Объект :class:`aiosend.types.App`
uk_ua: Об'єкт :class:`aiosend.types.Check`

source: createInvoice method.
ru: Метод createInvoice.
uk_ua: Метод createInvoice.

source: Use this method to create a new invoice. On success, returns an object of the created :class:`aiosend.types.Invoice`.
ru: Используйте этот метод для создания нового счёта. В случае успеха возвращает объект созданного :class:`aiosend.types.Invoice`.
uk_ua: Використовуйте цей метод для створення нового рахунку. У разі успіху повертає об'єкт створеного :class:`aiosend.types.Invoice`.

source: Source: https://help.crypt.bot/crypto-pay-api#createInvoice
ru: Источник: https://help.crypt.bot/crypto-pay-api#createInvoice
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#createInvoice

source: Amount of the invoice in float. For example: `125.50`
ru: Сумма счёта в формате вещественного числа. Например: `125,50`
uk_ua: Сума рахунку у форматі речового числа. Наприклад: `125.50`

source: *Optional*. Type of the price, can be “crypto” or “fiat”. Defaults to crypto.
ru: *Опционально*. Тип цены, может быть “crypto” или “fiat”. По умолчанию crypto.
uk_ua: *Опціонально*. Тип ціни, може бути “crypto” або “fiat”. За замовчуванням crypto.

source: *Optional*. Required if currency_type is “crypto”. Cryptocurrency alphabetic code. Supported assets: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC”.
ru: *Опционально*. Требуется если currency_type - “crypto”. Алфавитный код криптовалюты. Поддерживаемые активы: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC”.
uk_ua: *Опціонально*. Потрібно якщо currency_type - “crypto”. Алфавітний код криптовалюти. Підтримувані активи: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” i “USDC”.

source: *Optional*. Required if currency_type is “fiat”. Fiat currency code. Supported fiat currencies: “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS".
ru: *Опционально*. Требуется если currency_type — “fiat”. Код фиатной валюты. Поддерживаемые фиатные валюты: “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” и “ILS”.
uk_ua: *Опціонально*. Потрібно, якщо currency_type — “fiat”. Код фіатної валюти. Підтримувані фіатні валюти: “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” i “ILS”.

source: *Optional*. List of cryptocurrency alphabetic codes. Assets which can be used to pay the invoice. Available only if currency_type is “fiat”. Supported assets: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet). Defaults to all currencies.
ru: *Опционально*. Список алфавитных кодов криптовалют. Активы, которыми можно оплатить счёт. Доступно только если currency_type - “fiat”. Поддерживаемые активы: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC” (и “JET” для testnet). По умолчанию все валюты.
uk_ua: *Опціонально*. Список алфавітних кодів криптовалют. Активи, якими можна сплатити рахунок. Доступно тільки якщо currency_type - “fiat”. Підтримувані активи: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” i “USDC” (i “JET” для testnet). За умовчанням використовуються всі валюти.

source: *Optional*. Description for the invoice. User will see this description when they pay the invoice. Up to 1024 characters.
ru: *Опционально*. Описание счёта. Пользователь увидит это описание когда оплатит счёт. До 1024 символов.
uk_ua: *Опціонально*. Опис рахунку. Користувач побачить цей опис коли оплатить рахунок. До 1024 символів.

source: *Optional*. Text of the message which will be presented to a user after the invoice is paid. Up to 2048 characters.
ru: *Опционально*. Текст сообщения, которое будет предоставлено пользователю после того, как счёт будет оплачен. До 2048 символов.
uk_ua: *Опціонально*. Текст повідомлення, яке буде надано користувачеві після того, як рахунок буде сплачено. До 2048 символів.

source: *Optional*. Label of the button which will be presented to a user after the invoice is paid.
ru: *Опционально*. Метка кнопки, которая будет будет предоставлена пользователю после оплаты счёта.
uk_ua: *Опціонально*. Мітка кнопки, яка буде надана користувачу після оплати рахунку.

source: *Optional*. Required if paid_btn_name is specified. URL opened using the button which will be presented to a user after the invoice is paid. You can set any callback link (for example, a success link or link to homepage). Starts with https or http.
ru: *Опционально*. Требуется, если paid_btn_name определён. Ссылка, открываемая с помощью кнопки, которая будет предоставлена пользователю после оплаты счёта. Вы можете установить любую колбэк-ссылку (например, ссылку успешного завершения или ссылку на домашнюю страницу). Начинается с https или http.
uk_ua: *Опціонально*. Потрібно, якщо визначено paid_btn_name. Посилання відкривається за допомогою кнопки, яка буде надана користувачеві після оплати рахунку. Ви можете встановити будь-яке посилання зворотного виклику (наприклад, посилання успішного виконання або посилання на домашню сторінку). Починається з https або http.

source: *Optional*. Any data you want to attach to the invoice (for example, user ID, payment ID, ect). Up to 4kb.
ru: *Опционально*. Любые данные, которые вы хотите прикрепить к счёту (например идентификатор пользователя, идентификатор платежа и т.д.). до 4 килобайт.
uk_ua: *Опціонально*. Будь-які дані, які ви хочете прикріпити до рахунку (наприклад, ідентифікатор користувача, ідентифікатор платежу тощо). до 4кілобайт.

source: *Optional*. Allow a user to add a comment to the payment. Defaults to :code:`True`.
ru: *Опционально*. Разрешить пользователю добавлять комментарии к оплате. По умолчанию :code:`True`.
uk_ua: *Опціонально*. Дозволити користувачеві додавати коментарі до оплати. За замовчуванням :code:`True`.

source: *Optional*. Allow a user to pay the invoice anonymously. Defaults to :code:`True`.
ru: *Опционально*. Разрешить пользователю оплатить счёт анонимно. По умолчанию :code:`True`.
uk_ua: *Опціонально*. Дозволити користувачеві сплатити рахунок анонімно. За замовчуванням :code:`True`.

source: *Optional*. You can set a payment time limit for the invoice in seconds. Values between 1-2678400 are accepted.
ru: *Опционально*. Вы можете задать временной лимит для оплаты счёта в секундах. Допустимы значения в диапазоне 1-2678400.
uk_ua: *Опціонально*. Ви можете задати тимчасовий ліміт для оплати рахунку за секунди. Допустимі значення в діапазоні 1-2678400.

source: :class:`aiosend.types.Invoice` object
ru: Объект :class:`aiosend.types.Invoice`
uk_ua: Об'єкт :class:`aiosend.types.Invoice`

source: deleteInvoice method.
ru: Метод deleteInvoice.
uk_ua: Метод deleteInvoice.

source: Use this method to delete invoices created by your app. Returns :code:`True` on success.
ru: Используйте этот метод для удаления счетов, созданных вашим приложением. Возвращает :code:`True` в случае успеха.
uk_ua: Використовуйте цей метод для видалення рахунків, створених вашим додатком. Повертає :code:`True` у разі успіху.

source: Source: https://help.crypt.bot/crypto-pay-api#hwjK
ru: Источник: https://help.crypt.bot/crypto-pay-api#hwjK
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#hwjK

source: Invoice ID to be deleted.
ru: Идентификатор счёта для удаления.
uk_ua: Ідентифікатор рахунку для видалення.

source: :code:`True` on success.
ru: :code:`True` в случае успеха.
uk_ua: :code:`True` у разі успіху.

source: To use /create_check method you need to enable it to the restriction settings in `@CryptoBot <https://send.t.me>`_ as follows:
ru: Для использования метода /create_check вам нужно включить его в настройках ограничений в `@CryptoBot <https://send.t.me>`_ следующим образом:
uk_ua: Для використання методу /create_check вам потрібно включити його до налаштуваннях обмежень в `@CryptoBot <https://send.t.me>`_ наступним образом:

source: 🏝 Crypto Pay -> My Apps -> <Your App> -> Security -> Checks -> Enable.
ru: 🏝 Crypto Pay -> Мои приложения -> <Ваше приложение> -> Безопасность -> Метод createCheck -> Включить.
uk_ua: 🏝 Crypto Pay -> Мої додатки -> <Ваш додаток> -> Безпека -> Метод createCheck -> Увімкнути.

source: createCheck method.
ru: Метод createCheck.
uk_ua: Метод createCheck.

source: Use this method to create a new check. On success, returns an object of the created :class:`aiosend.types.Check`.
ru: Используйте этот метод для создания нового чека. В случае успеха возвращает объект созданного :class:`aiosend.types.Check`.
uk_ua: Використовуйте цей метод для створення нового чека. У разі успіху повертає об'єкт створеного :class:`aiosend.types.Check`.

source: Source: https://help.crypt.bot/crypto-pay-api#createCheck
ru: Источник: https://help.crypt.bot/crypto-pay-api#createCheck
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#createCheck

source: Amount of the check in float. For example: `125.50`
ru: Сумма чека в формате вещественного числа. Например: `125.50`
uk_ua: Сума чека у форматі речового числа. Наприклад: `125.50`

source: Cryptocurrency alphabetic code. Supported assets: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet).
ru: Алфавитный код криптовалюты. Поддерживаемые активы: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC” (и “JET” для testnet).
uk_ua: Алфавітний код криптовалюти. Підтримувані активи: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” i “USDC” (i “JET” для testnet).

source: *Optional*. ID of the user who will be able to activate the check.
ru: *Опционально*. Идентификатор пользователя, который сможет активировать чек.
uk_ua: *Опціонально*. Ідентифікатор користувача, який зможе активувати чек.

source: *Optional*. A user with the specified username will be able to activate the check.
ru: *Опционально*. Только пользователь с определённым именем пользователя сможет активировать чек.
uk_ua: *Опціонально*. Тільки користувач з певним ім'ям користувача зможе активувати чек

source: :class:`aiosend.types.Check` object
ru: Объект :class:`aiosend.types.Check`
uk_ua: Об'єкт :class:`aiosend.types.Check`

source: deleteCheck method.
ru: Метод deleteCheck.
uk_ua: Метод deleteCheck.

source: Use this method to delete checks created by your app. Returns :code:`True` on success.
ru: Используйте этот метод для удаления чеков, созданных вашим приложением. Возвращает :code:`True` в случае успеха.
uk_ua: Використовуйте цей метод для видалення чеків, створених вашим додатком. Повертає :code:`True` у разі успіху.

source: Source: https://help.crypt.bot/crypto-pay-api#deleteCheck
ru: Источник: https://help.crypt.bot/crypto-pay-api#deleteCheck
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#deleteCheck

source: Check ID to be deleted.
ru: Идентификатор чека для удаления.
uk_ua: Ідентифікатор чека для видалення.

source: To use /transfer method you need to enable it to the restriction settings in `@CryptoBot <https://send.t.me>`_ as follows:
ru: Для использования метода /transfer вам нужно включить его в настройках ограничений в `@CryptoBot <https://send.t.me>`_ следующим образом:
uk_ua: Для використання методу /transfer вам потрібно включити його в налаштуваннях обмеження в `@CryptoBot <https://send.t.me>`_ наступним чином:

source: 🏝 Crypto Pay -> My Apps -> <Your App> -> Security -> Transfers -> Enable.
ru: 🏝 Crypto Pay -> Мои приложения -> <Ваше приложение> -> Безопасность -> Метод transfer -> Включить.
uk_ua: 🏝 Crypto Pay -> Мої додатки -> <Ваш додаток> -> Безпека -> Метод transfer -> Увімкнути.

source: transfer method.
ru: Метод transfer.
uk_ua: Метод transfer.

source: Use this method to send coins from your app's balance to a user. On success, returns completed :class:`aiosend.types.Transfer`. This method must first be enabled in the security settings of your app.
ru: Используйте этот метод для отправки монет из баланса вашего приложения пользователю. В случае успеха возвращает :class:`aiosend.types.Transfer`. Этот метод сначала должен быть включен в настройках безопасности вашего приложения.
uk_ua: Використовуйте цей метод для відправки монет з балансу вашої програми Користувачеві. У разі успіху повертає :class:`aiosend.types.Transfer`. Цей метод спочатку повинен бути включений у налаштуваннях безпеки вашого додатку.

source: Source: https://help.crypt.bot/crypto-pay-api#transfer
ru: Источник: https://help.crypt.bot/crypto-pay-api#transfer
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#transfer

source: User ID in Telegram. User must have previously used @CryptoBot (@CryptoTestnetBot for testnet).
ru: Идентификатор пользователя в Telegram. Пользователь должен быть пользователем @CryptoBot (@CryptoTestnetBot для тестовой сети).
uk_ua: Ідентифікатор користувача в Telegram. Користувач повинен бути користувачем @CryptoBot (@CryptoTestnetBot для тестової мережі).

source: Amount of the transfer in float. The minimum and maximum amount limits for each of the supported assets roughly correspond to 1-25000 USD. Use :meth:`aiosend.CryptoPay.get_exchange_rates` to convert amounts. For example: `125.50`
ru: Сумма перевода в формате вещественного числа. Минимальные и максимальные ограничения суммы для каждого из поддерживаемых активов примерно соответствуют 1-25000 USD. Используйте :meth:`aiosend.CryptoPay.get_exchange_rates` для конвертации сумм. Например: `125.50`
uk_ua: Сума переказу у форматі речового числа. Мінімальні та максимальні обмеження суми для кожного з активів, що підтримуються приблизно відповідають 1-25000 USD. Використовуйте :meth:`aiosend.CryptoPay.get_exchange_rates` для конвертації сум. Наприклад: `125.50`

source: Random UTF-8 string unique per transfer for idempotent requests. The same `spend_id` can be accepted only once from your app. Up to 64 symbols.
ru: Случайная строка в кодировке UTF-8 уникальная для каждого перевода для идемпотентных запросов. Один и тот же `spend_id` может быть принят только один раз вашем приложении. До 64 символов.
uk_ua: Випадковий рядок у кодуванні UTF-8 є унікальним для кожного переказу для ідемопотентних запитів. Один і той же `spend_id` може бути прийнятий тільки один раз у вашому додатку. До 64 символів.

source: *Optional*. Comment for the transfer. Users will see this comment in the notification about the transfer. Up to 1024 symbols.
ru: *Опционально*. Комментарий к переводу. Пользователь увидит этот комментарий в уведомлении о переводе. До 1024 символов.
uk_ua: *Опціонально*. Коментар до переказу. Користувач побачить цей коментар у повідомленні про переказ. До 1024 символів.

source: *Optional*. Pass true to not send to the user the notification about the transfer. Defaults to :code:`False`.
ru: *Опционально*. Поместите True, чтобы не отправлять пользователю уведомление о переводе. По умолчанию :code:`False`.
uk_ua: *Опціонально*. Помістіть True, щоб не надсилати користувачеві повідомлення про переказ. За замовчуванням :code:`False`.

source: :class:`aiosend.types.Transfer` object.
ru: Объект :class:`aiosend.types.Transfer`
uk_ua: Об'єкт :class:`aiosend.types.Transfer`

source: getInvoices method.
ru: Метод getInvoices.
uk_ua: Метод getInvoices.

source: Use this method to get invoices created by your app. On success, returns array of :class:`aiosend.types.Invoice`.
ru: Используйте этот метод для получения счетов, созданных в вашем приложении. В случае успеха возвращает массив объектов :class:`aiosend.types.Invoice`.
uk_ua: Використовуйте цей метод для отримання рахунків, створених у вашому додатку. У разі успіху повертає масив об'єктів :class:`aiosend.types.Invoice`.

source: Source: https://help.crypt.bot/crypto-pay-api#getInvoices
ru: Источник: https://help.crypt.bot/crypto-pay-api#getInvoices
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getInvoices

source: *Optional*. Cryptocurrency alphabetic code. Supported assets: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet). Defaults to all currencies.
ru: *Опционально*. Алфавитный код криптовалюты. Поддерживаемые активы: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC” (и “JET” для testnet). По умолчанию все валюты.
uk_ua: *Опціонально*. Алфавітний код криптовалюти. Підтримувані активи: “USDT”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” i “USDC” (і “JET” для testnet). За замовчуванням усі валюти.

source: *Optional*. Fiat currency code. Supported fiat currencies: “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS". Defaults to all currencies.
ru: *Опционально*. Код фіатної валюти. Підтримувані фіатні валюти: “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS”. За замовчуванням всі валюти.
uk_ua: *Опціонально*. Підтримувані активи: “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” i “USDC” (i “JET” для testnet). За замовчуванням всі валюти.

source: *Optional*. List of invoice IDs separated by comma.
ru: *Опционально*. Список идентификаторов счетов, разделённых запятой.
uk_ua: *Опціонально*. Список ідентифікаторів рахунків, розділених комою.

source: *Optional*. Status of invoices to be returned. Available statuses: “active” and “paid”. Defaults to all statuses.
ru: *Опционально*. Статус счетов, которые должны быть возвращены. Доступные статусы: “active” и “paid”. По умолчанию все статусы.
uk_ua: *Опціонально*. Статус рахунків, які мають бути повернуті. Доступні статуси: “active” та “paid”. За замовчуванням усі статуси.

source: *Optional*. Offset needed to return a specific subset of invoices. Defaults to 0.
ru: *Опционально*. Смещение, нужное для возврата определённого подмножества счетов. По умолчанию 0.
uk_ua: *Опціонально*. Зміщення, необхідне повернення певного підмножини рахунків. За замовчуванням 0.

source: *Optional*. Number of invoices to be returned. Values between 1-1000 are accepted. Defaults to 100.
ru: *Опционально*. Количество счетов, которые должны быть возвращены. Допустимы значения в диапазоне 1-1000. По умолчанию 100.
uk_ua: *Опціонально*. Кількість рахунків, які потрібно повернути. Допустимі значення в діапазоні 1-1000. За замовчуванням 100.

source: List of :class:`aiosend.types.Invoice` objects.
ru: Список объектов :class:`aiosend.types.Invoice`.
uk_ua: Список об'єктів :class:`aiosend.types.Invoice`.

source: getChecks method.
ru: Метод getCheck.
uk_ua: Метод getCheck.

source: Use this method to get checks created by your app. On success, returns array of :class:`aiosend.types.Check`.
ru: Используйте этот метод для получения чеков, созданных вашим приложением. В случае успеха возвращает массив объектов :class:`aiosend.types.Check`.
uk_ua: Використовуйте цей метод для отримання чеків, створених вашим додатком. У разі успіху повертає масив об'єктів :class:`aiosend.types.Check`.

source: Source: https://help.crypt.bot/crypto-pay-api#getChecks
ru: Источник: https://help.crypt.bot/crypto-pay-api#getChecks
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getChecks

source: *Optional*. List of check IDs separated by comma.
ru: *Опционально*. Список идентификаторов чеков, разделённых запятой.
uk_ua: *Опціонально*. Список ідентифікаторів рахунків, розділених комою.

source: *Optional*. Status of check to be returned. Available statuses: “active” and “activated”. Defaults to all statuses.
ru: *Опционально*. Статус чеков, которые нужно вернуть. Доступные статусы: “active” и “activated”. По умолчанию все статусы
uk_ua: *Опціонально*. Статус чеків, які потрібно повернути. Доступні статуси: “active” та “activated”. За замовчуванням усі статуси.

source: *Optional*. Offset needed to return a specific subset of check. Defaults to 0.
ru: *Опционально*. Смешение, нужное для возврата определённого подмножества чеков. По умолчанию 0
uk_ua: *Опціонально*. Змішання, необхідне повернення певного підмножини чеків. За замовчуванням 0

source: *Optional*. Number of checks to be returned. Values between 1-1000 are accepted. Defaults to 100.
ru: *Опционально*. Количество чеков, которые должны быть возвращены. Допустимы значения в диапазоне 1-1000. По умолчанию 100.
uk_ua: *Опціонально*. Кількість чеків, які мають бути повернуті. Допустимі значення в діапазоні 1-1000. За замовчуванням 100.

source: List of :class:`aiosend.types.Check` objects.
ru: Список объектов :class:`aiosend.types.Check`
uk_ua: Список об'єктів :class:`aiosend.types.Check`.

source: getTransfers method.
ru: Метод getTransfers.
uk_ua: Метод getTransfers.

source: Use this method to get transfers created by your app. On success, returns array of :class:`aiosend.types.Transfer`.
ru: Используйте этот метод для получения переводов, созданных вашим приложением. В случае успеха возвращает массив объектов :class:`aiosend.types.Transfer`.
uk_ua: Використовуйте цей метод для отримання переказів, створених вашим додатком. У разі успіху повертає масив об'єктів :class:`aiosend.types.Transfer`.

source: Source: https://help.crypt.bot/crypto-pay-api#getTransfers
ru: Источник: https://help.crypt.bot/crypto-pay-api#getTransfers
uk_ua: Джерело: https://help.crypt.bot/crypto-pay-api#getTransfers

source: *Optional*. List of transfer IDs separated by comma.
ru: *Опционально*. Список идентификаторов переводов, разделённых запятой.
uk_ua: *Опціонально*. Список ідентифікаторів переказів, розділених комою.

source: *Optional*. Unique UTF-8 transfer string.
ru: *Опционально*. Уникальная строка перевода в кодировке UTF-8.
uk_ua: *Опціонально*. Унікальний рядок переказ кодування UTF-8.

source: *Optional*. Offset needed to return a specific subset of transfers. Defaults to 0.
ru: *Опционально*. Смещение, нужное для возвращения указанного подмножества переводов. По умолчанию 0.
uk_ua: *Опціонально*. Зміщення, необхідне повернення зазначеного підмножини переказів. За замовчуванням 0.

source: *Optional*. Number of transfers to be returned. Values between 1-1000 are accepted. Defaults to 100.
ru: *Опционально*. Количество переводов, которые должны быть возвращены. Допустимые значения в диапазоне 1-1000. По умолчанию 100.
uk_ua: *Опціонально*. Кількість переказів, які мають бути повернуті. Допустимі значення в діапазоні 1-1000. За замовчуванням 100.

source: List of :class:`aiosend.types.Transfer` objects.
ru: Список объектов :class:`aiosend.types.Transfer`.
uk_ua: Список об'єктів :class:`aiosend.types.Transfer`.

source: getBalance method.
ru: Метод getBalance.
uk_ua: Метод getBalance.
