Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/api/session.po
Languages: uk_ua

source: Session
uk_ua: Сесія

source: Bases: :py:class:`~aiosend.client.session.base.BaseSession`
uk_ua: Базові класи: :py:class:`~aiosend.client.session.base.BaseSession`

source: Http session based on aiohttp.
uk_ua: Сесія HTTP, заснована на aiohttp.

source: This class is a wrapper of `aiohttp.ClientSession`.
uk_ua: Цей клас є обгорткою над `aiohttp.ClientSession`.

source: Make http request.
uk_ua: Виконати HTTP-запит.

source: Return type
uk_ua: Тип результату

source: Bases: :py:class:`~abc.ABC`
uk_ua: Базові класи: :py:class:`~abc.ABC`

source: Abstract session class.
uk_ua: Абстрактний клас сесії.

source: If you want to implement your own session class, you should inherit this class.
uk_ua: Якщо ви хочете створити свій клас сесії, використовуйте цей клас як базовий.

source: **aiosend** uses `aiohttp <https://docs.aiohttp.org/en/stable/index.html>`_ session by default. You can implement your own session by inheriting :class:`BaseSession <aiosend.client.session.BaseSession>` and overriding :attr:`request <aiosend.client.session.BaseSession.request>` and :attr:`close <aiosend.client.session.BaseSession.close>` methods.
uk_ua: **aiosend * * за замовчуванням використовує сесію ' aiohttp <https://docs.aiohttp.org/en/stable/index.html>'_.Ви можете створити свій сеанс на основі :class:`BaseSession <aiosend.client.session.BaseSession>`, перевизначивши методи: attr:' request <aiosend.client.session.BaseSession.request> ' і :attr:`close <aiosend.client.session.BaseSession.close>`.
