Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/api/types.po
Languages: ru

source: Types
ru: Типы

source: `Crypto Pay API <https://help.crypt.bot/crypto-pay-api>`_ types implementation.
ru: Реализация типов `Crypto Pay API <https://help.crypt.bot/crypto-pay-api>`_

source: App object.
ru: Объект App.

source: This object represents the `Crypto Pay` app.
ru: Этот объект представляет приложение `Crypto Pay`.

source: Crypto Pay app id.
ru: id приложения Crypto Pay.

source: Crypto Pay app name.
ru: Имя приложения Crypto Pay.

source: Telegram username of the payment processing bot.
ru: Имя пользователя telegram бота для обработки платежей.

source: AppStats object.
ru: Объект AppStats.

source: Source: http://help.crypt.bot/crypto-pay-api#wnPA
ru: Источник: http://help.crypt.bot/crypto-pay-api#wnPA

source: Conversion of all created invoices.
ru: Конверсия всех созданных счетов.

source: Total created invoice count.
ru: Общее количество созданных счетов.

source: The date on which the statistics calculation was ended in ISO 8601 format.
ru: Дата, на которую был завершен расчет статистики в формате ISO 8601.

source: Total paid invoice count.
ru: Общее количество оплаченных счетов.

source: The date on which the statistics calculation was started in ISO 8601 format.
ru: Дата, с которой был начат расчет статистики в формате ISO 8601.

source: The unique number of users who have paid the invoice.
ru: Уникальное количество пользователей, оплативших счет.

source: Total volume of paid invoices in USD.
ru: Общий объем оплаченных счетов в USD.

source: Balance object.
ru: Объект Balance.

source: Source: https://help.crypt.bot/crypto-pay-api#Balance
ru: Источник: https://help.crypt.bot/crypto-pay-api#Balance

source: Total available amount in float.
ru: Общая доступная сумма в виде вещественного числа.

source: Cryptocurrency alphabetic code. Currently, can be “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet).
ru: Алфавитный код криптовалюты. В настоящее время это могут быть “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC” (и “JET” для тестовой сети).

source: Unavailable amount currently is on hold in float.
ru: Недоступная сумма, находящаяся на удержании, в виде вещественного числа.

source: Check object.
ru: Объект Check.

source: Source: https://help.crypt.bot/crypto-pay-api#Check
ru: Источник: https://help.crypt.bot/crypto-pay-api#Check

source: Date the check was activated in ISO 8601 format.
ru: Дата активации чека в формате ISO 8601.

source: Amount of the check in float.
ru: Сумма чека в виде вещественного числа.

source: URL should be provided to the user to activate the check.
ru: URL, который должен быть представлен пользователю для активации чека.

source: Unique ID for this check.
ru: Уникальный ID чека.

source: Date the check was created in ISO 8601 format.
ru: Дата создания чека в формате ISO 8601.

source: Hash of the check.
ru: Хеш чека.

source: Status of the check, can be “active” or “activated”.
ru: Статус чека, может быть “active” или “activated”.

source: Base object class for types.
ru: Базовый класс объекта типа.

source: Currency object.
ru: Объект Currency.

source: This object represents an `Crypto Pay` currency.
ru: Этот объект представляет объект валюты `Crypto Pay`.

source: Currency code.
ru: Код валюты.

source: Currency decimals.
ru: Десятичные дроби валюты.

source: True, if the currency is blockchain currency.
ru: True, если валюта является блокчейн-валютой.

source: True, if the currency is fiat.
ru: True, если валюта является фиатной.

source: True, if the currency is stablecoin.
ru: True, если валюта является стабильной монетой.

source: Currency name.
ru: Название валюты.

source: Currency url.
ru: URL валюты.

source: API error model.
ru: Модель ошибки API.

source: ExchangeRate object.
ru: Объект ExchangeRate.

source: Source: https://help.crypt.bot/crypto-pay-api#ExchangeRate
ru: Источник: https://help.crypt.bot/crypto-pay-api#ExchangeRate

source: True, if the source is the cryptocurrency.
ru: True, если исходная валюта является криптовалютой.

source: True, if the source is the fiat currency.
ru: True, если исходная валюта является фиатной валютой.

source: True, if the received rate is up-to-date.
ru: True, если полученный курс актуален.

source: The current rate of the source asset valued in the target currency.
ru: Текущий курс исходной валюты, оцененный в целевой валюте.

source: Currency alphabetic code. Currently, can be “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC”.
ru: Алфавитный код валюты. На данный момент может быть “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” или “USDC”.

source: Fiat currency code. Currently, can be “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS".
ru: Алфавитный код фиатной валюты. На данный момент может быть “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” или “ILS”.

source: Invoice object.
ru: Объект Invoice.

source: Source: https://help.crypt.bot/crypto-pay-api#Invoice
ru: Источник: https://help.crypt.bot/crypto-pay-api#Invoice

source: *Optional*. List of assets which can be used to pay the invoice. Available only if currency_type is “fiat”. Currently, can be “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet).
ru: *Опционально*. Список валют, который могут быть использованы для оплаты счёта. Доступен только если currency_type является “fiat”. На данный момент может быть “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC” (и “JET” для testnet).

source: True, if the user can pay the invoice anonymously.
ru: True, если пользователь может оплатить счёт анонимно.

source: True, if the user can add comment to the payment.
ru: True, если пользователь может оставить комментарий к платежу.

source: Amount of the invoice for which the invoice was created.
ru: Сумма созданного счёта.

source: *Optional*. Cryptocurrency code. Available only if the value of the field currency_type is “crypto”. Currently, can be “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” and “USDC” (and “JET” for testnet).
ru: *Опционально*. Код криптовалюты. Доступен только если значение поля currency_type является “crypto”. На данный момент может быть “USDT”, “TON”, “BTC”, “ETH”, “LTC”, “BNB”, “TRX” и “USDC” (и “JET” для testnet).

source: URL should be provided to the user to pay the invoice.
ru: URL, который должен быть представлен пользователю для оплаты счёта.

source: *Optional*. Comment to the payment from the user.
ru: *Опционально*. Комментарий пользователя к платежу.

source: Date the invoice was created in ISO 8601 format.
ru: Дата создания счёта в формате ISO 8601.

source: Type of the price, can be “crypto” or “fiat”.
ru: Тип цены, может быть “crypto” или “fiat”.

source: *Optional*. Description for this invoice.
ru: *Опционально*. Описание данного счёта.

source: *Optional*. Date the invoice expires in ISO 8601 format.
ru: *Опционально*. Дата истечения срока действия счёта в формате ISO 8601.

source: *Optional*. Amount of charged service fees. Available only in the payload of the webhook update (described here for reference).
ru: *Опционально*. Сумма платы за обслуживание. Доступно только в полезной нагрузке webhook обновления (описано здесь для справки).

source: *Optional*. Amount of service fees charged when the invoice was paid. Available only if status is “paid”.
ru: *Опционально*. Сумма платы за обслуживание, взимаемая при оплате счета. Доступна только при наличии статуса “paid”.

source: *Optional*. Asset of service fees charged when the invoice was paid. Available only if status is “paid”.
ru: *Опционально*. Валюта платы за обслуживание, взимаемая при оплате счета. Доступна только при наличии статуса “paid”.

source: *Optional*. Amount in USD of service fees charged when the invoice was paid. Available only if status is “paid”.
ru: *Опционально*. Сумма платы за обслуживание, взимаемая при оплате счета в USD. Доступна только при наличии статуса “paid”.

source: *Optional*. Fiat currency code. Available only if the value of the field currency_type is “fiat”. Currently one of “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS".
ru: *Опционально*. Код фиатной валюты. Доступен только если значение поля currency_type является “fiat”. На данный момент может быть “USD”, “EUR”, “RUB”, “BYN”, “UAH”, “GBP”, “CNY”, “KZT”, “UZS”, “GEL”, “TRY”, “AMD”, “THB”, “INR”, “BRL”, “IDR”, “AZN”, “AED”, “PLN” and “ILS”.

source: Hash of the invoice.
ru: Хеш счёта.

source: *Optional*. Text of the hidden message for this invoice.
ru: *Опционально*. Текст скрытого сообщения счёта.

source: Unique ID for this invoice.
ru: Уникальный ID данного счёта.

source: Use this URL to pay an invoice to the Telegram Mini App version.
ru: Используйте этот URL чтобы оплатить счёт в Telegram Mini App версии.

source: *Optional*. Amount of the invoice for which the invoice was paid. Available only if currency_type is “fiat” and status is “paid”.
ru: *Опционально*. Сумма оплаченного счёта. Доступно только если currency_type является “fiat” и статус является “paid”.

source: True, if the invoice was paid anonymously.
ru: True, если счёт был оплачен анонимно.

source: *Optional*. Cryptocurrency alphabetic code for which the invoice was paid. Available only if currency_type is “fiat” and status is “paid”.
ru: *Опционально*. Алфавитный код криптовалюты оплаченного счёта. Доступен только если currency_type является “fiat” и статус является “paid”.

source: *Optional*. Date the invoice was paid in ISO 8601 format.
ru: *Опционально*. Дата оплаты счёта в формате ISO 8601.

source: *Optional*. Label of the button, can be “viewItem”, “openChannel”, “openBot” or “callback”.
ru: *Опционально*. Метка кнопки, может быть “viewItem”, “openChannel”, “openBot” или “callback”.

source: *Optional*. URL opened using the button.
ru: *Опционально*. URL, который открывается при нажатии на кнопку.

source: *Optional*. The rate of the paid_asset valued in the fiat currency. Available only if the value of the field currency_type is “fiat” and the value of the field status is “paid”.
ru: *Опционально*. Курс оплаченной валюты, выраженный в фиатной валюте. Доступен только если значение поля currency_type является “fiat” и значение поля status является “paid”.

source: *Optional*. Price of the asset in USD. Available only if status is “paid”.
ru: *Опционально*. Цена валюты в USD. Доступна только если статус является “paid”.

source: *Deprecated*. URL should be provided to the user to pay the invoice (described here for reference).
ru: *Устаревшее*. URL, который должен быть представлен пользователю для оплаты счёта. (описано здесь для справки).

source: *Optional*. Previously provided data for this invoice.
ru: *Опционально*. Ранее предоставленная полезная нагрузка счёта.

source: Status of the transfer, can be “active”, “paid” or “expired”.
ru: Статус перевода, может быть “active”, “paid” или “expired”.

source: *Optional*. Price of the asset in USD. Available only in the Webhook update payload.
ru: *Опционально*. Цена валюты в USD. Доступна только в полезной нагрузке webhook обновления

source: Use this URL to pay an invoice to the Web version of Crypto Bot.
ru: Используйте этот URД для оплаты счёта в Веб версии Crypto Bot.

source: Items list.
ru: Список элементов.

source: This model is used to convert a dictionary with the `items` key to a list.
ru: Эта модель используется для конвертации словаря с ключом `items` в список.

source: API response model.
ru: Модель ответа API.

source: Transfer object.
ru: Объект Transfer.

source: Source: https://help.crypt.bot/crypto-pay-api#Transfer
ru: Источник: https://help.crypt.bot/crypto-pay-api#Transfer

source: Amount of the transfer in float.
ru: Сумма перевода в виде вещественного числа.

source: *Optional*. Comment for this transfer.
ru: *Опционально*. Комментарий к переводу.

source: Date the transfer was completed in ISO 8601 format.
ru: Дата выполнения перевода в формате ISO 8601.

source: Unique UTF-8 string.
ru: Уникальная UTF-8 строка.

source: Status of the transfer, can only be “completed”.
ru: Статус перевода, может быть только “completed”.

source: Unique ID for this transfer.
ru: Уникальный ID для данного перевода.

source: Telegram user ID the transfer was sent to.
ru: Telegram ID пользователя, которому был отправлен перевод.

source: Update object.
ru: Объект Update.

source: Source: https://help.crypt.bot/crypto-pay-api#webhook-updates
ru: Источник: https://help.crypt.bot/crypto-pay-api#webhook-updates

source: Payload contains the class Invoice.
ru: Полезная нагрузка, которая содержит класс Invoice.

source: Date the request was sent in ISO 8601 format.
ru: Дата отправки запроса в формате ISO 8601.

source: Non-unique update ID.
ru: Неуникальный ID обновления.

source: `invoice_paid` - the update sent when the invoice is paid.
ru: `invoice_paid` - обновления было отправлено когда счёт был оплачен.

source: type
ru: Типы

source: Webhook update type. Supported update types
ru: Тип webhook обновления. Поддерживаемые типы обновлений
