Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/events/check_polling.po
Languages: ru, uk_ua

source: Check polling
ru: Поллинг чеков
uk_ua: Поллінг чеків

source: Polling is a method of receiving updates by periodically sending requests. Once :attr:`check status <aiosend.types.Check.status>` is changed to :attr:`ACTIVATED <aiosend.enums.CheckStatus.ACTIVATED>`, :class:`polling manager <aiosend.polling.PollingManager>` will call the :meth:`check_polling <aiosend.CryptoPay.check_polling>` handler. Check polling uses the :meth:`/getChecks <aiosend.CryptoPay.get_invoices>` method.
ru: Поллинг - это метод получения обновлений путём периодической отправки запросов. После того, как :attr:`статус чека <aiosend.types.Check.status>` будет изменён на :attr:`ACTIVATED <aiosend.enums.CheckStatus.ACTIVATED>`, :class:`поллинг менеджер <aiosend.polling.PollingManager>` вызовет обработчик :meth:`check_polling <aiosend.CryptoPay.check_polling>`. Поллинг чеков использует метод :meth:`/getChecks <aiosend.CryptoPay.get_checks>`.
uk_ua: Полінг - це метод отримання оновлень шляхом періодичного відправлення запитів. Після того, як :attr:`статус чека <aiosend.types.Check.status>` буде змінено на :attr:`ACTIVATED <aiosend.enums.CheckStatus.ACTIVATED>`, :class:`поллінг менеджер <aiosend.polling.PollingManager>` викличе обробник :meth:`check_polling <aiosend.CryptoPay.check_polling>`. Поллінг чеків використовує метод :meth:`/getChecks <aiosend.CryptoPay.get_checks>`.

source: :class:`Polling manager <aiosend.polling.PollingManager>` has :class:`configuration <aiosend.polling.PollingConfig>` that defines the :attr:`delay <aiosend.polling.PollingConfig.delay>` (between requests) and :attr:`timeout <aiosend.polling.PollingConfig.timeout>` for each check in the awaiting queue. After the timeout polling manager will stop polling that check and call the :meth:`expired_check_polling <aiosend.CryptoPay.expired_check_polling>` handler if it is declared.
ru: :class:`Поллинг менеджер <aiosend.polling.PollingManager>` имеет :class:`конфигурацию <aiosend.polling.PollingConfig>`, в которой в которой задаются :attr:`задержка <aiosend.polling.PollingConfig.delay>` между запросами и :attr:`таймаут <aiosend.polling.PollingConfig.timeout>` для каждого чека в очереди. После истечения таймаута менеджер прекратит поллинг этого чека и вызовет обработчик :meth:`expired_check_polling <aiosend.CryptoPay.expired_check_polling>`, если тот указан.
uk_ua: :class:`Полінг менеджер <aiosend.polling.PollingManager>` має :class:`конфігурацію <aiosend.polling.PollingConfig>`, в якій у якій задаються :attr:`затримка <aiosend.polling.PollingConfig.delay>` між запитами і :attr:`таймаут <aiosend.polling.PollingConfig.timeout>` для кожного чека в черзі. Після закінчення таймауту менеджер припинить поллінг цього чека і викличе обробник :meth:`expired_check_polling <aiosend.CryptoPay.expired_check_polling>`, якщо його вказано.

source: **Default is 2 seconds delay and 300 seconds (5 min) timeout**.
ru: **По умолчанию задержка между запросами - 2 секунды, а таймаут - 300 секунд (5 минут)**.
uk_ua: ** За замовчуванням затримка між запитами - 2 секунди, а тайм-аут - 300 секунд (5 хвилин)**.

source: :doc:`You can change the polling configuration. <polling_config>`
ru: :doc:`Вы можете изменять конфигурацию поллинга <polling_config>`
uk_ua: :doc:`Ви можете змінювати конфігурацію полінгу <polling_config>`

source: Register a handler for polling check updates.
ru: Добавление обработчика для уведомлений поллинга чеков.
uk_ua: Додавання оброблювача для повідомлень поллінга чеків.

source: Decorator for handler function.
ru: Декоратор для функции-обработчика.
uk_ua: Декоратор для функції-обробника.

source: handler function.
ru: функция-обработчик.
uk_ua: функція-обробник.

source: Register a handler for timed out checks.
ru: Добавление обработчика для истёкших чеков.
uk_ua: Додавання оброблювача для чеків.

source: Usage example
ru: Пример использования
uk_ua: Приклад використання
