Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/events/invoice_polling.po
Languages: ru, uk_ua

source: Invoice polling
ru: Поллинг счетов
uk_ua: Поллінг рахунків

source: Polling is a method of receiving updates by periodically sending requests. Once :attr:`invoice status <aiosend.types.Invoice.status>` is changed to :attr:`PAID <aiosend.enums.InvoiceStatus.PAID>`, :class:`polling manager <aiosend.polling.PollingManager>` will call the :meth:`invoice_polling <aiosend.CryptoPay.invoice_polling>` handler. Invoice polling uses the :meth:`/getInvoices <aiosend.CryptoPay.get_invoices>` method.
ru: Поллинг - это метод получения обновлений путём периодической отправки запросов. После того, как :attr:`статус счёта <aiosend.types.Invoice.status>` будет изменён на :attr:`PAID <aiosend.enums.InvoiceStatus.PAID>`, :class:`поллинг-менеджер <aiosend.polling.PollingManager>` вызовет обработчик :meth:`invoice_polling <aiosend.CryptoPay.invoice_polling>`. Поллинг счетов использует метод :meth:`/getInvoices <aiosend.CryptoPay.get_invoices>`.
uk_ua: Полінг - це метод отримання оновлень шляхом періодичного відправлення запитів. Після того, як :attr:`статус рахунку <aiosend.types.Invoice.status>` буде змінено на :attr:`PAID <aiosend.enums.InvoiceStatus.PAID>`, :class:`поллінг-менеджер <aiosend.polling.PollingManager>` викличе обробник :meth:`invoice_polling <aiosend.CryptoPay.invoice_polling>`. Поллінг Рахунків використовує метод :meth:`/getInvoices <aiosend.CryptoPay.get_invoices>`.

source: :class:`Polling manager <aiosend.polling.PollingManager>` has :class:`configuration <aiosend.polling.PollingConfig>` that defines the :attr:`delay <aiosend.polling.PollingConfig.delay>` (between requests) and :attr:`timeout <aiosend.polling.PollingConfig.timeout>` for each invoice in the awaiting queue. After the timeout polling manager will stop polling that invoice and call the :meth:`expired_invoice_polling <aiosend.CryptoPay.expired_invoice_polling>` handler if it is declared.
ru: Менеджер опроса :class:`Polling manager <aiosend.polling.PollingManager>` имеет настройки :class:`configuration <aiosend.polling.PollingConfig>`, в которых задаются :attr:`задержка <aiosend.polling.PollingConfig.delay>` (между запросами) и :attr:`таймаут <aiosend.polling.PollingConfig.timeout>` для каждого счета в очереди. После истечения таймаута менеджер прекращает опрос данного счета и, если указан, вызывает обработчик :meth:`expired_invoice_polling <aiosend.CryptoPay.expired_invoice_polling>`.
uk_ua: :class:`Менеджер опитування <aiosend.polling.PollingManager>` має :class:`налаштування <aiosend.polling.PollingConfig>`, в яких задаються :attr:`затримка <aiosend.polling.PollingConfig.delay>` (між запитами) та :attr:`таймаут <aiosend.polling.PollingConfig.timeout>` для кожного рахунку в черзі. Після закінчення таймауту менеджер припиняє опитування даного рахунку і, якщо вказаний, викликає обробник :meth:`expired_invoice_polling <aiosend.CryptoPay.expired_invoice_polling>`.

source: **Default is 2 seconds delay and 300 seconds (5 min) timeout**.
ru: **По умолчанию задержка между запросами — 2 секунды, а таймаут — 300 секунд (5 минут)**.
uk_ua: ** За замовчуванням затримка між запитами - 2 секунди, а тайм-аут - 300 секунд (5 хвилин)**.

source: :doc:`You can change the polling configuration. <polling_config>`
ru: :doc:`Вы можете изменить настройки опроса. <polling_config>`
uk_ua: :doc:`Ви можете змінити налаштування опитування. <polling_config>`

source: Register a handler for polling invoice updates.
ru: Назначьте функцию-обработчик для обновлений счетов при опросе.
uk_ua: Призначте функцію-обробник для оновлення рахунків під час опитування.

source: Decorator for handler function.
ru: Декоратор для функции-обработчика.
uk_ua: Декоратор для функції-обробника.

source: handler function.
ru: функция-обработчик.
uk_ua: функція-обробник.

source: Register a handler for timed out invoices.
ru: Назначьте функцию-обработчик для счетов с истекшим временем ожидания.
uk_ua: Призначте функцію-обробник для рахунків з часом очікування.

source: Usage example
ru: Пример использования
uk_ua: Приклад використання
