Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/events/payload_data.po
Languages: ru, uk_ua

source: Payload Data is used to generate a structured payload using the pydantic model.
ru: Payload Data используется для создания структурированной полезной нагрузки с помощью модели pydantic.
uk_ua: Payload Data використовується для створення структурованої корисної навантаження за допомогою моделі pydantic.

source: Base payload data class.
ru: Базовый класс полезной нагрузки.
uk_ua: Базовий клас корисного навантаження.

source: Generate a filter for payload with rule.
ru: Создать фильтр для полезной нагрузки с правилом.
uk_ua: Створити фільтр для корисного навантаження з правилом.

source: magic rule
ru: магическое правило
uk_ua: магічне правило

source: Generate payload data string.
ru: Создать строку полезной нагрузки.
uk_ua: Створити рядок корисного навантаження.

source: Parse payload data string.
ru: Спарсить строку данных полезной нагрузки.
uk_ua: Спарсіть рядок даних корисного навантаження.

source: Usage example
ru: Пример использования
uk_ua: Приклад використання

source: Define a subclass of :class:`PayloadData <aiosend.PayloadData>`. The keyword :code:`prefix` is required to specify the prefix, and the :code:`sep` argument can be provided to define the separator (default is :).
ru: Определите подкласс :class:`PayloadData <aiosend.PayloadData>`. Ключевое слово :code:`prefix` требуется для указания префикса, а аргумент :code:`sep` может быть передан для определения разделителя.
uk_ua: Визначте підклас :class:`PayloadData <aiosend.PayloadData>`. Ключове слово :code:`prefix` потрібно вказати префікс, а аргумент :code:`sep` може бути переданий для визначення роздільника.

source: Now you can create an instance of this class, pack it into a string, and then pass it in the :attr:`Invoice payload <aiosend.types.Invoice.payload>`.
ru: Теперь вы можете создать экземпляр этого класса, упаковать его в строку и затем передать в :attr:`Invoice payload <aiosend.types.Invoice.payload>`.
uk_ua: Тепер ви можете створити екземпляр цього класу, упакувати його в рядок, а потім передати в :attr:`Invoice payload <aiosend.types.Invoice.payload>`.

source: To handle an invoice payment event, you need to declare a handler with a PayloadData filter. You can access an instance of your PayloadData via the handler’s named argument :code:`payload_data`.
ru: Чтобы обработать событие оплаты счета, вам необходимо объявить обработчик с фильтром PayloadData. Вы можете получить доступ к экземпляру вашего PayloadData с помощью именованного аргумента обработчика :code:`payload_data`.
uk_ua: Щоб обробити подію оплати рахунку, Вам потрібно оголосити обробник з фільтром PayloadData. Ви можете отримати доступ до екземпляра Вашого PayloadData за допомогою іменованого аргументу обробника :code:`payload_data`.

source: Also you can filter events by specific rules using `magic filters from aiogram 3.x <https://docs.aiogram.dev/en/latest/dispatcher/filters/magic_filters.html#magic-filters>`_.
ru: Также вы можете фильтровать события по определенным правилам, используя `магические фильтры из aiogram 3.x <https://docs.aiogram.dev/en/latest/dispatcher/filters/magic_filters.html#magic-filters>`_.
uk_ua: Також ви можете фільтрувати події за певними правилами, використовуючи `магічні фільтри з aiogram 3.x <https://docs.aiogram.dev/en/latest/dispatcher/filters/magic_filters.html#magic-filters>`_.
