Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/events/routers.po
Languages: ru, uk_ua

source: Routers
ru: Роутеры
uk_ua: Роутери

source: Router is an object for routing updates. There are two types of routers: :class:`PollingRouter <aiosend.polling.PollingRouter>` and :class:`WebhookRouter <aiosend.webhook.WebhookRouter>`. :class:`CryptoPay <aiosend.CryptoPay>` is the root router for both of them. One router can include another router, but in the end, the parent router must be included in the root router via :meth:`include_router <aiosend._events.BaseRouter.include_router>` or :meth:`include_routers <aiosend._events.BaseRouter.include_routers>` methods.
ru: Роутер - это объект для маршрутизации обновлений. Существует два типа роутеров: :class:`PollingRouter <aiosend.polling.PollingRouter>` и :class:`WebhookRouter <aiosend.webhook.WebhookRouter>`. :class:`CryptoPay <aiosend.CryptoPay>` является главным роутером для них обоих. Один роутер может включать другой роутер, но в конечном итоге родительский роутер должен быть включен в главный роутер с помощью метода :meth:`include_router <aiosend._events.BaseRouter.include_router>` или :meth:`include_routers <aiosend._events.BaseRouter.include_routers>`.
uk_ua: Роутер - це об'єкт для маршрутизації оновлень. Існує два типи роутерів: :class:`PollingRouter <aiosend.polling.PollingRouter>` і :class:`WebhookRouter <aiosend.webhook.WebhookRouter>`. :class:`CryptoPay <aiosend.CryptoPay>` є головним маршрутизатором для обох з них. Одні маршрутизатор може бути включений в інший маршрутизатор за допомогою методів :meth:`include_router <aiosend._events.BaseRouter.include_router>` або :meth:`include_routers <aiosend._events.BaseRouter.include_routers>`.

source: Usage example
ru: Пример использования
uk_ua: Приклад використання

source: Base router for handling and propagate events.
ru: Базовый роутер для обработки и распространения событий.
uk_ua: Базовий роутер для обробки і поширення подій.

source: Include another router to this one.
ru: Включить другой роутер в этот.
uk_ua: Включити інший роутер в цей.

source: Include multiple routers to this one.
ru: Включить несколько роутеров в этот.
uk_ua: Включити кілька роутерів в цей.

source: Router for polling events.
ru: Роутер для поллинг событий.
uk_ua: Роутер для поллінг-подій.

source: Router for webhook updates.
ru: Роутер для вебхук событий.
uk_ua: Роутер для вебхук-подій.

source: Event observers
ru: Наблюдатели событий
uk_ua: Спостерігачі подій

source: Event observer is an object that stores event handlers. You can attach a new event handler to event observer using a :code:`@router.<event type>(...)` decorator or a :code:`router.<event type>.register(...)` method.
ru: Наблюдатель событий - это объект, который хранит обработчики событий. Вы можете прикрепить новый обработчик событий к наблюдателю событий с помощью декоратора :code:`@router.<event type>(...)` или метода :code:`router.<event type>.register(...)`.
uk_ua: Спостерігач подій - це об'єкт, який зберігає обробники подій. Ви можете прикріпити новий обробник подій до спостерігача подій з допомогою: code:`@router.<event type>(...)` декоратора або методу :code:`router.<event type>.register(...)`.

source: Event observer for storing handlers and propagating events.
ru: Наблюдатель событий для хранения обработчиков и распространения событий.
uk_ua: Спостерігач подій для зберігання обробників та розповсюдження подій.

source: Register event handler.
ru: Зарегистрировать новый обработчик.
uk_ua: Зареєструвати обробник подій.

source: Trigger event observer.
ru: Вызвать наблюдатель событий.
uk_ua: Викликати спостерігач подій.

source: Polling Router
ru: Поллинг-роутер
uk_ua: Поллінг роутер.

source: Available observers for :class:`PollingRouter <aiosend.polling.PollingRouter>` are listed here.
ru: Здесь перечислены доступные наблюдатели для :class:`PollingRouter <aiosend.polling.PollingRouter>`.
uk_ua: Тут перераховані доступні рецензенти для :class:`PollingRouter <aiosend.polling.PollingRouter>`.

source: Paid invoice
ru: Оплаченный счёт
uk_ua: Оплачений рахунок

source: Expired invoice
ru: Просроченный счёт
uk_ua: Прострочений рахунок

source: Activated check
ru: Активированный чек
uk_ua: Активований чек

source: Expired check
ru: Просроченный чек
uk_ua: Прострочений чек

source: Webhook Router
ru: Вебхук-роутер
uk_ua: Вебхук роутер

source: Available observers for :class:`WebhookRouter <aiosend.webhook.WebhookRouter>` are listed here.
ru: Здесь перечислены доступные наблюдатели для :class:`WebhookRouter <aiosend.webhook.WebhookRouter>`.
uk_ua: Тут перераховані доступні рецензенти для :class:`WebhookRouter <aiosend.webhook.WebhookRouter>`.
