Repository: vovchic17/aiosend
Catalog: docs/locale/*/LC_MESSAGES/events/webhook.po
Languages: ru, uk_ua

source: Webhook
ru: Вебхуки
uk_ua: Вебхукі

source: To use webhooks you need to enable them in the `@CryptoBot <https://send.t.me>`_ settings as follows:
ru: Для использования вебхуков вам нужно включить их в настройках `@CryptoBot <https://send.t.me>`_ следующим образом:
uk_ua: Для використання веб-хуків вам потрібно включити їх у налаштуваннях`@CryptoBot <https://send.t.me>`_ наступним чином:

source: 🏝 Crypto Pay -> My Apps -> YOUR APP -> Webhooks -> 🌕 Enable webhooks.
ru: 🏝 Crypto Pay -> Мои приложения -> <Ваше приложение> -> Вебхуки -> 🌕 Включить вебхуки.
uk_ua: 🏝 Crypto Pay -> Мої додатки -> <Ваш додаток> -> Вебхукі -> 🌕 Включити вебхуки.

source: Register a handler for webhook invoice updates.
ru: Добавление обработчика для вебхук-уведомлений.
uk_ua: Додавання обробника для вебхук-повідомлень.

source: Decorator for handler function.
ru: Декоратор для функции-обработчика.
uk_ua: Декоратор для функції-обробника.

source: handler function.
ru: функция-обработчик.
uk_ua: функція-обробник.

source: Usage example with `aiohttp web server <https://docs.aiohttp.org/en/stable/web_quickstart.html>`_
ru: Пример использования с `aiohttp веб-сервером <https://docs.aiohttp.org/en/stable/web_quickstart.html>`_
uk_ua: Приклад використання з `aiohttp веб-сервером<https://docs.aiohttp.org/en/stable/web_quickstart.html>`_

source: Usage example with `fastapi web server <https://fastapi.tiangolo.com/tutorial/first-steps/>`_
ru: Пример использования с `fastapi веб-сервером <https://fastapi.tiangolo.com/tutorial/first-steps/>`_
uk_ua: Приклад використання з `fastapi веб-сервером<https://fastapi.tiangolo.com/tutorial/first-steps/>`_

source: In order to use aiosend with fastapi you need to install extra package
ru: Чтобы использовать aiosend с fastapi, вам нужно установить экстра зависимость
uk_ua: Щоб використовувати aiosend з fastapi, вам потрібно встановити екстра залежність

source: Usage example with `flask web server <https://flask.palletsprojects.com/en/3.0.x/quickstart/#quickstart>`_
ru: Пример использования с `flask веб-сервером <https://flask.palletsprojects.com/en/3.0.x/quickstart/#quickstart>`_
uk_ua: Приклад використання з `flask веб-сервером<https://flask.palletsprojects.com/en/3.0.x/quickstart/#quickstart>`_

source: In order to use aiosend with flask you need to install extra package
ru: Чтобы использовать aiosend с flask, вам нужно установить экстра зависимость
uk_ua: Щоб використовувати aiosend з flask, вам потрібно встановити екстра залежність

source: **aiosend** uses `aiohttp <https://docs.aiohttp.org/en/stable/index.html>`_ as web server by default. You can implement your own webhook manager by inheriting :class:`aiosend.webhook.WebhookManager` and overriding :attr:`aiosend.webhook.WebhookManager.register_handler`.
ru: **aiosend** использует `aiohttp <https://docs.aiohttp.org/en/stable/index.html>`_ как веб-сервер по умолчанию. Вы можете добавить свой собственный менеджер вебхуков, наследуя :class:`aiosend.webhook.WebhookManager` и переопределяя :attr:`aiosend.webhook.WebhookManager.register_handler`.
uk_ua: **aiosend** використовує `aiohttp<https://docs.aiohttp.org/en/stable/index.html>`_ як веб-сервер за замовчанням.Ви можете додати свій власний менеджер веб-хуків, наслідуючи :class:`aiosend.webhook.WebhookManager` і перевизначаючи:attr:`aiosend.webhook.WebhookManager.register_handler`.

source: Webhook manager.
ru: Менеджер вебхуков.
uk_ua: Менеджер вебхуків.

source: If you want to implement your own webhook manager, you must inherit from this class.
ru: Если вы хотите создать свой собственный менеджер вебхуков, вы должны наследоваться от этого класса.
uk_ua: Якщо ви хочете створити свій власний менеджер вебхуків, ви повинніуспадковуватись від цього класу

source: Register webhook handler.
ru: Регистрация обработчика вебхуков.
uk_ua: Реєстрація обробника вебхуків.

source: Override this method in your own webhook manager class. This method is used for registering webhook handler in your app.
ru: Переопределите этот метод в классе вашего менеджера вебхуков. Этот метод используется для регистрации обработчика вебхуков в вашем приложении.
uk_ua: Перевизначте цей метод у класі вашого менеджера веб-хуків. Цей метод використовується для реєстрації обробника веб-хуків у вашому додатку.

source: Web server handler object.
ru: Объект обработчика веб-сервера.
uk_ua: Об'єкт обробника веб-сервера.

source: aiohttp webhook manager.
ru: Менеджер вебхуков на aiohttp.
uk_ua: Менеджер вебхуків на aiohttp.

source: Webhook manager based on :class:`aiohttp.web.Application`.
ru: Менеджер вебхуков, базирующийся на :class:`aiohttp.web.Application`.
uk_ua: Менеджер веб-хуків, що базується на :class:`aiohttp.web.Application`.

source: FastAPI webhook manager.
ru: Менеджер вебхуков на FastAPI.
uk_ua: Менеджер вебхуків на FastAPI.

source: Webhook manager based on :class:`fastapi.FastAPI`.
ru: Менеджер вебхуков, базирующийся на :class:`fastapi.FastAPI`.
uk_ua: Менеджер вебхуків, що базується на :class:`fastapi.FastAPI`.

source: Flask webhook manager.
ru: Менеджер вебхуков на Flask.
uk_ua: Менеджер вебхуків на Flask.

source: Webhook manager based on :class:`flask.Flask`.
ru: Менеджер вебхуков, базирующийся на :class:`flask.Flask`.
uk_ua: Менеджер вебхуків, що базується на :class:`flask.Flask`.
